Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ОбособленныеПодразделения/РЭЙ_ОбособленныеПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_ОбособленныеПодразделения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ОбособленныеПодразделения/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Перем ИдентификаторОтбораПоВладельцу;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановкаЗначенияОтбора();
	ОбновитьЗаголовок();

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	УстановкаЗначенияОтбора();
	ОбновитьЗаголовок();

КонецПроцедуры
  


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭлементОтбора = Список.Отбор.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораПоВладельцу);
	ЭлементОтбора.ПравоеЗначение = Организация;
	
	ОбновитьЗаголовок();	
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ОбновитьЗаголовок()
	ДанныеОбОрганизации = ПолучитьДанныеОбОрганизации(Организация);

	Заголовок = "Список подразделений организации " + ДанныеОбОрганизации.Наименование;			
	Элементы.Список.ПодчиненныеЭлементы.КодПоОКАТО.Видимость = ДанныеОбОрганизации.ЭтоЮрЛицо;
	Элементы.Список.ПодчиненныеЭлементы.КПП.Видимость = ДанныеОбОрганизации.ЭтоЮрЛицо;	
КонецПроцедуры // ОбновитьЗаголовок()

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбОрганизации(парОрганизация)
	Результат = Новый Структура;
	Результат.Вставить("Наименование", парОрганизация.Наименование);
	Результат.Вставить("ЭтоЮрЛицо",	ПарОрганизация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура УстановкаЗначенияОтбора()
	Если Организация.Пустая() Тогда
		Организация = РЭЙ_Универсализация.ПолучитьОсновнуюОрганизацию();		
	КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Организация;
	ЭлементОтбора.Использование = Истина;
	ИдентификаторОтбораПоВладельцу	= Список.Отбор.ПолучитьИдентификаторПоОбъекту(ЭлементОтбора);	
КонецПроцедуры
